app/views/home/index.html.haml

SELECT "articles".* FROM "articles" WHERE "articles"."game_id" IN (1)
---
- @games.each do |game|
  - game.articles.each do |article|
    .article_thumb
      .title= link_to game.title, article
      .author= "par #{article.author.name}"