app/controllers/articles_controller.rb

  def index

  	@articles = {}
    Game.all.each do |game|
---
SELECT "games".* FROM "games"

  def show
  	p params
  	@article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]