app/controllers/home_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."game_id" IN (1)
SELECT "games".* FROM "games"
---
  def index
  	@games = Game.includes(:articles)